# Ultralytics YOLO11 - 道路异常事件检测 (完整改进模型)
# 创新点1: SADR (尺度自适应动态路由) 嵌入Backbone末端
# 创新点2: BDFR (背景解耦特征精炼) 嵌入Neck各融合节点

# 类别数
nc: 3  # debris, illegal_parking, retrograde

scales:
  m: [0.67, 0.75, 768]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]           # 5  P4/16
  - [-1, 2, C3k2, [512, True]]           # 6
  - [-1, 1, Conv, [1024, 3, 2]]          # 7  P5/32
  - [-1, 2, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 1, SADR, [1024]]                # 10 ★ 创新点1: 尺度自适应动态路由
  - [-1, 2, C2PSA, [1024]]               # 11

# Neck + Head
head:
  # === FPN 自顶向下 ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, Concat, [1]]                      # 13
  - [-1, 2, C3k2, [512, False]]                    # 14
  - [-1, 1, BDFR, [512]]                           # 15 ★ 创新点2: 背景解耦精炼

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
  - [[-1, 4], 1, Concat, [1]]                      # 17
  - [-1, 2, C3k2, [256, False]]                    # 18
  - [-1, 1, BDFR, [256]]                           # 19 ★ 创新点2: 背景解耦精炼

  # === PAN 自底向上 ===
  - [-1, 1, Conv, [256, 3, 2]]                     # 20
  - [[-1, 15], 1, Concat, [1]]                     # 21
  - [-1, 2, C3k2, [512, False]]                    # 22
  - [-1, 1, BDFR, [512]]                           # 23 ★ 创新点2: 背景解耦精炼

  - [-1, 1, Conv, [512, 3, 2]]                     # 24
  - [[-1, 11], 1, Concat, [1]]                     # 25
  - [-1, 2, C3k2, [1024, True]]                    # 26
  - [-1, 1, BDFR, [1024]]                          # 27 ★ 创新点2: 背景解耦精炼

  # === 检测头: 三尺度输出 ===
  - [[19, 23, 27], 1, Detect, [nc]]                # 28
